# -*- ii: apisnoop; -*-
#+TITLE: StatefulSets Apps endpoints
#+AUTHOR: ii team
#+TODO: TODO(t) NEXT(n) IN-PROGRESS(i) BLOCKED(b) | DONE(d)
#+OPTIONS: toc:nil tags:nil todo:nil
#+EXPORT_SELECT_TAGS: export
#+PROPERTY: header-args:sql-mode :product postgres

*** 1. Create a Statefulset yaml file, namespace and Deployment


#+begin_src yaml :tangle statefulset_test.yaml
apiVersion: v1
kind: Service
metadata:
  name: nginx
  labels:
    app: nginx
spec:
  ports:
  - port: 80
    name: web
  clusterIP: None
  selector:
    app: nginx
---
apiVersion: apps/v1
kind: StatefulSet
metadata:
  name: web
spec:
  selector:
    matchLabels:
      app: nginx # has to match .spec.template.metadata.labels
  serviceName: "nginx"
  replicas: 3 # by default is 1
  template:
    metadata:
      labels:
        app: nginx # has to match .spec.selector.matchLabels
    spec:
      terminationGracePeriodSeconds: 10
      containers:
      - name: nginx
        image: k8s.gcr.io/nginx-slim:0.8
        ports:
        - containerPort: 80
          name: web
        volumeMounts:
        - name: www
          mountPath: /usr/share/nginx/html
  volumeClaimTemplates:
  - metadata:
      name: www
    spec:
      accessModes: [ "ReadWriteOnce" ]
      storageClassName: "my-storage-class"
      resources:
        requests:
          storage: 1Gi

#+end_src
- Tangle to create the .yaml file - `,bt`


- See if the yaml file was created
#+begin_src shell :results raw
  pwd
 ls -al /home/riaan/Project/ticket-writing |grep .yaml

 #ls -al /home/ii/ticket-writing | grep yaml
#+end_src

#+RESULTS:
#+begin_example
/home/riaan/Project/ticket-writing
-rw-rw-r--  1 riaan riaan    404 Dec 11 06:39 deployment_test.yaml
-rw-rw-r--  1 riaan riaan   1029 Dec 11 06:39 statefulset_test.yaml
#+end_example





- Create a Namespace
#+begin_src shell :results raw
kubectl create namespace app-statefulset-tests
#+end_src

#+RESULTS:
#+begin_example
namespace/app-statefulset-tests created
#+end_example






- Create a Deployment
#+begin_src shell :results raw
kubectl apply -f statefulset_test.yaml --namespace=app-statefulset-tests
#+end_src

#+RESULTS:
#+begin_example
service/nginx created
statefulset.apps/web created
#+end_example






***  2. Find the statefulset
#+begin_src shell :results raw
  kubectl get statefulset -A | grep web
#+end_src

#+RESULTS:
#+begin_example
app-statefulset-tests   web    0/3     79m
#+end_example



WIP- Still to convert below this point

*** 8. Cleanup


- Delete the deployment and the namespace
#+begin_src shell :results raw
  kubectl delete statefulset web
  kubectl delete namespaces/app-statefulset-tests

#+end_src

#+RESULTS:
#+begin_example
namespace "app-statefulset-tests" deleted
#+end_example



- Look for deployment and namespace to check if it is deleted

#+begin_src shell :results raw
  kubectl get namespace app-deploy-tests
  kubectl get deployment nginx-deployment
#+end_src

- ALL DONE!



* Verifying increase in coverage with APISnoop                       :export:
Discover useragents:
  #+begin_src sql-mode :eval never-export :exports both :session none
    select distinct useragent
      from testing.audit_event
      where useragent like 'live%';
  #+end_src

  #+RESULTS:
  :  useragent
  : -----------
  : (0 rows)
  :

List endpoints hit by the test:
#+begin_src sql-mode :exports both :session none
select * from testing.endpoint_hit_by_new_test;
#+end_src

#+RESULTS:
#+begin_SRC example
 useragent | endpoint | hit_by_ete | hit_by_new_test
-----------+----------+------------+-----------------
(0 rows)

#+end_SRC

Display endpoint coverage change:
  #+begin_src sql-mode :eval never-export :exports both :session none
    select * from testing.projected_change_in_coverage;
  #+end_src

  #+RESULTS:
  #+begin_SRC example
     category    | total_endpoints | old_coverage | new_coverage | change_in_number
  ---------------+-----------------+--------------+--------------+------------------
   test_coverage |             862 |          343 |          343 |                0
  (1 row)

  #+end_SRC




#+begin_src sql-mode :exports both :session none
  select distinct  endpoint, right(useragent,73) AS useragent
  from testing.audit_event
   where useragent ilike '%scale subresource2%'
   -- where endpoint ilike '%AppsV1NamespacedStatefulSet%'
   and release_date::BIGINT > round(((EXTRACT(EPOCH FROM NOW()))::numeric)*1000,0) - 60000
  and useragent like 'e2e%'
  order by endpoint
  limit 30;

#+end_src

#+RESULTS:
#+begin_SRC example
                 endpoint                  |                                 useragent
-------------------------------------------+---------------------------------------------------------------------------
 connectCoreV1GetNodeProxyWithPath         | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 createAppsV1NamespacedStatefulSet         | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 createCoreV1Namespace                     | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 createCoreV1NamespacedPod                 | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 createCoreV1NamespacedService             | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 deleteAppsV1NamespacedStatefulSet         | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 deleteCoreV1Namespace                     | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 listAppsV1NamespacedStatefulSet           | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 listCoreV1NamespacedEvent                 | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 listCoreV1NamespacedPersistentVolumeClaim | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 listCoreV1NamespacedPod                   | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 listCoreV1NamespacedServiceAccount        | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 listCoreV1Node                            | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 listCoreV1PersistentVolume                | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 listPolicyV1beta1PodSecurityPolicy        | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 patchAppsV1NamespacedStatefulSetScale     | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 readAppsV1NamespacedStatefulSet           | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 readAppsV1NamespacedStatefulSetScale      | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 readCoreV1Node                            | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
 replaceAppsV1NamespacedStatefulSet        | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
                                           | [StatefulSetBasic] should have a working scale subresource2 [Conformance]
(21 rows)

#+end_SRC










